[{"name":"Module 1","title":"Logique et langage des ensembles.","description":"1. Connecteurs  2. Langage des ensembles  3. Quantificateurs  4. Implication  5. Applications  6. Relations  7. Démonstrations  8. Rédaction  9. Cardinal d'un ensemble","url":"https://uel.unisciel.fr/mathematiques/logique1/logique1/co/logique1.html"},{"name":"Module 2","title":"Nombres réels, suites et fonctions.","description":"1. Les Réels  2. Nombres réels, suites et fonctions  3. Généralités sur les fonctions  4. Etude locale des fonctions d'une variable réelle.","url":"https://uel.unisciel.fr/mathematiques/analyse1/analyse1/co/analyse1.html"},{"name":"Module 3","title":"Étude globale des fonctions de classe Cn","description":"1. Fonctions continues sur un intervalle  2. Théorème et inégalité des accroissements finis. Formule de Taylor-Lagrange (TAF)  3. Fonctions convexes.","url":"https://uel.unisciel.fr/mathematiques/analyse2/analyse2/co/analyse2.html"},{"name":"Module 4","title":"Développements limités","description":"1. Introduction : des études locales  2. Définitions et propriétés  3. Développements limités usuels  4. Opérations sur les développements limités  5. Développements limités en un point autre que 0  6. Application aux études locales  7. Fonctions équivalentes au voisinage d'un point  8. Étude graphique des développements limités  9. Sens des développements limités  10. Calcul des développements limités  11. Branches infinies  12. Évaluations.","url":"https://uel.unisciel.fr/mathematiques/dev_limites/dev_limites/co/dev_limites.html"},{"name":"Module 5","title":"Fonctions usuelles et fonctions réciproques","description":"1. Théorème des fonctions réciproques  2. Fonctions usuelles et leurs réciproques.","url":"https://uel.unisciel.fr/mathematiques/analyse3/analyse3/co/analyse3.html"},{"name":"Module 6","title":"Intégration","description":"1. Introduction  2. Intégrale de Riemann  3. Méthodes générales de calcul d'intégrales  4. Calcul pratique d'intégrales  5. Approximations numériques.","url":"https://uel.unisciel.fr/mathematiques/integration/integration/co/integration.html"},{"name":"Module 7","title":"Intégrales impropres.","description":"1. Définitions et théorèmes généraux  2. Intégrales impropres des fonctions positives  3. Intégrales des fonctions de signe quelconque  4. Exemples de calcul d'intégrales impropres  5. Relation entre la convergence des intégrales et des séries.","url":"https://uel.unisciel.fr/mathematiques/intimp/intimp/co/intimp.html"},{"name":"Module 8","title":"Equations différentielles.","description":"1. Introduction  2. Etude qualitative  3. Résolution explicite  4. Méthodes numériques  5. Compléments sur l'étude qualitative  6. Problèmes de synthèse  7. Travaux pratiques.","url":"https://uel.unisciel.fr/mathematiques/eq_diff/eq_diff/co/eq_diff.html"},{"name":"Module 9","title":"Systèmes différentiels.","description":"1. Systèmes différentiels - Notions de base  2. Systèmes linéaires à coefficients constants  3. Portraits de phase et points stationnaires  4. Travaux pratiques.","url":"https://uel.unisciel.fr/mathematiques/sys_diff/sys_diff/co/sys_diff.html"},{"name":"Module 10","title":"Séries numériques.","description":"1. Séries numériques - Cours  2. Séries numériques - exercices d'entraînement  3. Séries numériques - Problèmes de synthèse.","url":"https://uel.unisciel.fr/mathematiques/serie/serie/co/serie.html"},{"name":"Module 11","title":"Suites et séries de fonctions.","description":"1. Suites de fonctions  2. Séries de fonctions.","url":"https://uel.unisciel.fr/mathematiques/suites_fonctions/suites_fonctions/co/suites_fonctions.html"},{"name":"Module 12","title":"Séries entières.","description":"1. Définitions et théorèmes généraux  2. Rayon et disque de convergence  3. Propriétés de la somme d'une série entière à l'intérieur du disque de convergence  4. Développement d'une fonction en série entière  5. Développements en série entière : méthodes et développements classiques  6. Exponentielle complexe  7. Étude de séries entières  8. Problèmes de synthèse.","url":"https://uel.unisciel.fr/mathematiques/series_ent/series_ent/co/series_ent.html"},{"name":"Module 13","title":"Arithmétique.","description":"1. Principe d'induction  2. Divisibilité  3. PGCD et PPCM  4. Équations diophantiennes  5. Nombres premiers  6. Évaluation.","url":"https://uel.unisciel.fr/mathematiques/arithmetique/arithmetique/co/arithmetique.html"},{"name":"Module 14","title":"Polynômes.","description":"1. Présentation et construction de l'anneau des polynômes à coefficients dans un corps  2. Arithmétique dans K[X]  3. Fonctions polynômes.","url":"https://uel.unisciel.fr/mathematiques/polynomes1/polynomes1/co/polynomes1.html"},{"name":"Module 15","title":"Géométrie analytique.","description":"1. Courbes et surfaces  2. Matrices à n lignes et p colonnes  3. Droites et plans  4. Espaces Rn  5. Systèmes linéaires  6. Déterminant.","url":"https://uel.unisciel.fr/mathematiques/geometrie_analytique/geometrie_analytique/co/geometrie_analytique.html"},{"name":"Module 16","title":"Espaces vectoriels.","description":"1. Généralités  2. Constructions  3. Espace vectoriel de type fini  4. Application linéaire  5. Problèmes de synthèse.","url":"https://uel.unisciel.fr/mathematiques/espacevect1/espacevect1/co/espacevect1.html"},{"name":"Module 17","title":"Calcul matriciel : matrice et espaces vectoriels.","description":"1. Matrices à n lignes et p colonnes  2. Matrices carrées  3. Structures de Mn, p(K)  4. Matrice et applications linéaires  5. Rang de matrices  6. Problèmes de synthèse.","url":"https://uel.unisciel.fr/mathematiques/calculmat1/calculmat1/co/calculmat1.html"},{"name":"Module 18","title":"Déterminants.","description":"1. Déterminants : définition, propriétés, calcul  2. Applications des déterminants  3. Problème de synthèse.","url":"https://uel.unisciel.fr/mathematiques/determinant1/determinant1/co/determinant1.html"},{"name":"Module 19","title":"Réduction des matrices.","description":"1. Endomorphisme ou matrice diagonalisable  2. Diagonalisation et géométrie  3. Polynôme minimal  4. Théorème de Cayley-Hamilton  5. Problèmes de synthèse.","url":"https://uel.unisciel.fr/mathematiques/reducmat1/reducmat1/co/reducmat1.html"},{"name":"Module 20","title":"Forme bilinéaire, forme quadratique sur R et C.","description":"1. Généralités sur les formes bilinéaires et les formes quadratiques  2. Orthogonalité  3. Bases orthogonales, bases orthonormales  4. Problèmes de synthèse.","url":"https://uel.unisciel.fr/mathematiques/formes1/formes1/co/formes1.html"}]